const testPageConfig = {
  title: "Test từ vựng N5",

  instruction: "Chọn đáp án đúng",

  testLabel: "Đề số",

   tests: [
    {
      id: 1,

      questions: [
        {
          question:
            "あそこで　タクシーに （　　　）。",

          answers: [
            "のりました",
            "あがりました",
            "つきました",
            "はいりました"
          ],

          correct: 0
        },

        {

          question:
            "まいあさ　7じに　いえを （　　　）。",

          answers: [
            "でます",
            "はいります",
            "つきます",
            "のります"
          ],

          correct: 0
        },

        {

          question:
            "としょかんで　本を （　　　）。",

          answers: [
            "ききます",
            "よみます",
            "かいます",
            "のみます"
          ],

          correct: 1
        },

        {

          question:
            "スーパーで　やさいを （　　　）。",

          answers: [
            "かります",
            "かいます",
            "かえします",
            "おくります"
          ],

          correct: 1
        },

        {

          question:
            "にちようびに　へやを （　　　）。",

          answers: [
            "そうじします",
            "うんてんします",
            "れんしゅうします",
            "さんぽします"
          ],

          correct: 0
        },

        {

          question:
            "えきで　でんしゃを （　　　）。",

          answers: [
            "おります",
            "のります",
            "わたります",
            "まがります"
          ],

          correct: 1
        },

        {

          question:
            "ともだちに　プレゼントを （　　　）。",

          answers: [
            "あげました",
            "もらいました",
            "かりました",
            "ならいました"
          ],

          correct: 0
        },

        {

          question:
            "わたしは　デパートに　つとめています。",

          answers: [
            "わたしは　デパートで　かいものを　して います。",
            "わたしは　デパートで　さんぽを　しています。",
            "わたしは　デパートで　しごとを　しています。",
            "わたしは　デパートで　やすんでいます。"
          ],

          correct: 2
        },

        {

          question:
            "きのうは　とても　いそがしかったです。",

          answers: [
            "きのうは　ひまでは　ありませんでした。",
            "きのうは　げんきでは　ありませんでした。",
            "きのうは　しずかでは　ありませんでした。",
            "きのうは　たのしく　ありませんでした。"
          ],

          correct: 0
        },

        {

          question:
            "この　かばんは　たかく　ありません。",

          answers: [
            "この　かばんは　おもいです。",
            "この　かばんは　やすいです。",
            "この　かばんは　ふるいです。",
            "この　かばんは　ちいさいです。"
          ],

          correct: 1
        }
    ]
    },

    {
      id: 2,

        questions: [

        {
        question:
            "ここは　としょかんです。（　　　）べんきょう　してください。",

        answers: [
            "べんりに",
            "しずかに",
            "にぎやかに",
            "かんたんに"
        ],

        correct: 1
        },

        {
        question:
            "さむくなったから、（　　　）を つけてください。",

        answers: [
            "スリッパ",
            "コート",
            "テレビ",
            "ストーブ"
        ],

        correct: 3
        },

        {
        question:
            "おふろに（　　　）からだを　あらいました。",

        answers: [
            "あびて",
            "とって",
            "とおって",
            "はいって"
        ],

        correct: 3
        },

        {
        question:
            "きのうは　500（　　　）およぎました。",

        answers: [
            "こ",
            "まい",
            "メートル",
            "グループ"
        ],

        correct: 2
        },

        {
        question:
            "いもうとは　きょねん（　　　）。ことし、いっさいに　なります。",

        answers: [
            "うまれました",
            "おきました",
            "はじまりました",
            "つきました"
        ],

        correct: 0
        },

        {
        question:
            "あの　レストランの　りょうりは　とても（　　　）ですよ。",

        answers: [
            "へた",
            "おいしい",
            "にぎやか",
            "じょうず"
        ],

        correct: 1
        },

        {
        question:
            "インドの（　　　）は　どうですか。おいしいですか。",

        answers: [
            "かいもの",
            "しょくぶつ",
            "たてもの",
            "たべもの"
        ],

        correct: 3
        },

        {
        question:
            "あさ　こうえんを　さんぽしました。",

        answers: [
            "あさ　こうえんを　とびました。",
            "あさ　こうえんを　まがりました。",
            "あさ　こうえんを　はしりました。",
            "あさ　こうえんを　あるきました。"
        ],

        correct: 3
        },

        {
        question:
            "あねは　おんがくが　すきです。",

        answers: [
            "あねは　よく　うたったり、ピアノを　ひいたりします。",
            "あねは　よく　えいがを　みたり、ほんを　よんだりします。",
            "あねは　よく　はしったり、およいだりします。",
            "あねは　よく　そうじしたり、せんたくしたりします。"
        ],

        correct: 0
        },

        {
        question:
            "きょうは　てんきが　いいです。",

        answers: [
            "きょうは　くもっています。",
            "きょうは　あめが　ふっています。",
            "きょうは　ゆきが　ふっています。",
            "きょうは　はれています。"
        ],

        correct: 3
        }
        ]
    },
{
  id: 3,

  questions: [

    {
      question:
        "きょうは　とても　つかれました。いえに　かえって（　　　）ねます。",

      answers: [
        "ほんとう",
        "すぐに",
        "たぶん",
        "ちょうど"
      ],

      correct: 1
    },

    {
      question:
        "（　　　）は　サッカーが　だいすきです。",

      answers: [
        "いす",
        "あに",
        "ねこ",
        "りんご"
      ],

      correct: 1
    },

    {
      question:
        "（　　　）ぼうしを　かいました。",

      answers: [
        "ひろい",
        "せまい",
        "おもい",
        "あおい"
      ],

      correct: 3
    },

    {
      question:
        "ゆうびんきょくは　どこですか。\n この　みちを（　　　）いって　ください。すぐ　そこですよ。",

      answers: [
        "まえに",
        "ちょうど",
        "はじめに",
        "まっすぐ"
      ],

      correct: 3
    },

    {
      question:
        "わたしは　コーヒーに　さとうを（　　　）のみます。",

      answers: [
        "いれて",
        "いって",
        "はいて",
        "はいって"
      ],

      correct: 0
    },

    {
      question:
        "うちから　かいしゃまで　あるいて　15ふん（　　　）。",

      answers: [
        "いります",
        "あります",
        "かけます",
        "かかります"
      ],

      correct: 3
    },

    {
      question:
        "もう　5じですね。（　　　）しつれいします。",

      answers: [
        "そろそろ",
        "もう",
        "ちょっと",
        "すぐ"
      ],

      correct: 0
    },

    {
      question:
        "わたしの　あねは　やまださんと　けっこんします。",

      answers: [
        "あねは　やまださんの　いもうとに　なります。",
        "あねは　やまださんの　おくさんに　なります。",
        "あねは　やまださんの　おばさんに　なります。",
        "あねは　やまださんの　ごしゅじんに　なります。"
      ],

      correct: 1
    },

    {
      question:
        "へやが　くらいですね。あかるく　してください。",

      answers: [
        "でんきを　けしてください。",
        "でんきを　つけてください。",
        "でんきを　つけないでください。",
        "でんきを　あけてください。"
      ],

      correct: 1
    },

    {
      question:
        "にちようびの　こうえんは　にぎやかです。",

      answers: [
        "にちようびの　こうえんは　きれいです。",
        "にちようびの　こうえんは　しずかです。",
        "にちようびの　こうえんは　ひとが　すくないです。",
        "にちようびの　こうえんは　ひとが　おおぜい　います。"
      ],

      correct: 3
    }

  ]
},

{
  id: 4,

  questions: [
    {
      question: "ちゅうごくごの　べんきょうは（　　　）ですか？",
      answers: [
        "いそがしい",
        "むずかしい",
        "さびしい",
        "たのしい"
      ],
      correct: 1
    },
    {
      question: "その（　　　）はきゃくが　いっぱいいるね。",
      answers: [
        "とり",
        "て",
        "みせ",
        "あね"
      ],
      correct: 2
    },
    {
      question: "これは（　　　）なもんだいです。",
      answers: [
        "あんぜん",
        "ゆうめい",
        "じょうぶ",
        "かんたん"
      ],
      correct: 3
    },
    {
      question: "なんじに　ごはんを（　　　）か？",
      answers: [
        "たべます",
        "のみます",
        "いきます",
        "すみます"
      ],
      correct: 0
    },
    {
      question: "このかばんは　ふるいですが、とても（　　　）。",
      answers: [
        "げんきです",
        "しずかです",
        "じょうぶです",
        "にぎやかです"
      ],
      correct: 2
    },
    {
      question: "かさは　そこに（　　　）ください。",
      answers: [
        "かいて",
        "ひいて",
        "おいて",
        "あいて"
      ],
      correct: 2
    },
    {
      question: " （　　　）ですから、ドアをあけて　ください。",
      answers: [
        "さむい",
        "あつい",
        "ながい",
        "ふるい"
      ],
      correct: 1
    },
    {
      question: "まいばん　くにの　かぞくに　でんわします。",
      answers: [
        "よるは　ときどき　くにの　かぞくに　でんわします。",
        "あさは　ときどき　くにの　かぞくに　でんわします。",
        "よるは　いつも　くにの　かぞくに　でんわします。",
        "あさは　いつも　くにの　かぞくに　でんわします。"
      ],
      correct: 2
    },
    {
      question: "この　まちには　ゆうめいな　たてものが　あります。",
      answers: [
        "この　まちには　ゆうめいな　ビルが　あります。",
        "この　まちには　ゆうめいな　おちゃが　あります。",
        "この　まちには　ゆうめいな　ケーキが　あります。",
        "この　まちには　ゆうめいな　たべものが　あります。"
      ],
      correct: 0
    },
    {
      question: "たんじょうびは　6がつ15にちです。",
      answers: [
        "6がつ15にちに　けっこんしました。",
        "6がつ15にちに　テストが　はじまりました。",
        "6がつ15にちに　うまれました。",
        "6がつ15にちに　くにへ　かえりました。"
      ],
      correct: 2
    }
  ]
},
{
  id: 5,

  questions: [
    {
      question: "わたしの　へやは　この（　　　）の　２かいです。",
      answers: [
        "エレベーター",
        "プール",
        "エアコン",
        "アパート"
      ],
      correct: 3
    },
    {
      question: "さとうさんは　ギターを　じょうずに（　　　）。",
      answers: [
        "うたいます",
        "ききます",
        "ひきます",
        "あそびます"
      ],
      correct: 2
    },
    {
      question: "けさ　そうじを　しましたから、へやは（　　　）です。",
      answers: [
        "きれい",
        "きたない",
        "あかるい",
        "くらい"
      ],
      correct: 0
    },
    {
      question: "このほんは　としょかんで（　　　）。",
      answers: [
        "もらいました",
        "かしました",
        "かいました",
        "かりました"
      ],
      correct: 3
    },
    {
      question: "きょうが　15日ですから、（　　　）は　13日ですね。",
      answers: [
        "あさって",
        "ことし",
        "おととい",
        "せんしゅう"
      ],
      correct: 2
    },
    {
      question: "キムさんは（　　　）にほんに　いますか。",
      answers: [
        "どちら",
        "どなた",
        "どのくらい",
        "どう"
      ],
      correct: 2
    },
    {
      question: "A: はじめまして。よろしく おねがいします。\nB:（　　　）、よろしく おねがいします。",
      answers: [
        "しつれいしました",
        "こちらこそ",
        "いただきます",
        "もしもし"
      ],
      correct: 1
    },
    {
      question: "がっこうのそばに　こうえんが　あります。",
      answers: [
        "こうえんは　がっこうの　なかです。",
        "こうえんは　がっこうの　そとです。",
        "こうえんは　がっこうの　ちかくです。",
        "こうえんは　がっこうの　むこうです。"
      ],
      correct: 2
    },
    {
      question: "あのひとは　わたしの　おじです。",
      answers: [
        "あのひとは　わたしの　ははの　ちちです。",
        "あのひとは　わたしの　ちちの　ちちです。",
        "あのひとは　わたしの　ははの　あねです。",
        "あのひとは　わたしの　ちちの　おとうとです。"
      ],
      correct: 3
    },
    {
      question: "わたしは　はじめて　にほんに　きました。",
      answers: [
        "わたしは　にほんに　きたことが　ありませんでした。",
        "わたしは　ことし　にほんに　きました。",
        "わたしは　にほんに　きたかったです。",
        "わたしは　らいねん　にほんに　きます。"
      ],
      correct: 0
    }
  ]
},
{
  id: 6,

  questions: [
    {
      question: "この（　　　）は　あまくて、おいしいです。",
      answers: [
        "おかし",
        "せっけん",
        "フォーク",
        "ちゃわん"
      ],
      correct: 0
    },
    {
      question: "ははは　さくらびょういんに（　　　）。",
      answers: [
        "はたらいています",
        "たべています",
        "つとめています",
        "のっています"
      ],
      correct: 2
    },
    {
      question: "ともだちから　ざっしを 3（　　　）もらいました。",
      answers: [
        "さつ",
        "まい",
        "だい",
        "ひき"
      ],
      correct: 0
    },
    {
      question: "でんきを　つけましたから、へやが（　　　）です。",
      answers: [
        "さむい",
        "きたない",
        "あかるい",
        "せまい"
      ],
      correct: 2
    },
    {
      question: "びょういんは　えきから（　　　）ですから、バスで　いきましょう。",
      answers: [
        "ながい",
        "ふとい",
        "とおい",
        "ひろい"
      ],
      correct: 2
    },
    {
      question: " （　　　）が　ありませんから、じかんが　わかりません。",
      answers: [
        "かぎ",
        "じしょ",
        "さいふ",
        "とけい"
      ],
      correct: 3
    },
    {
      question: "かばんは　いすの　うえに（　　　）ください。",
      answers: [
        "のって",
        "おいて",
        "まって",
        "すわって"
      ],
      correct: 1
    },
    {
      question: "にちようびは　だいたい　いえに　います。",
      answers: [
        "にちようびは　よく　あそびに　いきます。",
        "にちようびは　あまり　でかけません。",
        "げつようびから　どようびまで　うちに　います。",
        "げつようびから　どようびまで　うちに　いません。"
      ],
      correct: 1
    },
    {
      question: "このみちを　まっすぐ　いってください。",
      answers: [
        "このみちを　まがらないで　いってください。",
        "このみちを　はやく　いってください。",
        "このみちを　ひとりで　いってください。",
        "このみちを　ちょっと　いってください。"
      ],
      correct: 0
    },
    {
      question: "いま　ごはんを　つくって　います。",
      answers: [
        "いま　べんきょうを　して　います。",
        "いま　せんたくを　して　います。",
        "いま　りょうりを　して　います。",
        "いま　れんしゅうを　して　います。"
      ],
      correct: 2
    }
  ]
},

{
  id: 7,

  questions: [
    {
      question: "あそこの　しんごうで（　　　）を　わたりましょう。",
      answers: [
        "ちかてつ",
        "ちず",
        "でぐち",
        "みち"
      ],
      correct: 3
    },
    {
      question: "この　でんしゃは　とうきょうえきを　9じに（　　　）。",
      answers: [
        "おります",
        "でます",
        "かえります",
        "はじまります"
      ],
      correct: 1
    },
    {
      question: "ことしの　なつは　あついですから、（　　　）が　ほしいです。",
      answers: [
        "ラジオ",
        "ストーブ",
        "エアコン",
        "テレビ"
      ],
      correct: 2
    },
    {
      question: "わたしの（　　　）は、ちちと　ははと　わたしの　3にんです。",
      answers: [
        "きょうだい",
        "こども",
        "りょうしん",
        "かぞく"
      ],
      correct: 3
    },
    {
      question: "あそこの　ドアから　なかに（　　　）ください。",
      answers: [
        "はいって",
        "のぼって",
        "ついて",
        "とまって"
      ],
      correct: 0
    },
    {
      question: "その　ナイフで　りんごを（　　　）ください。",
      answers: [
        "しめて",
        "おきて",
        "きって",
        "つけて"
      ],
      correct: 2
    },
    {
      question: " （　　　）を　わすれましたから、じかんが　わかりません。",
      answers: [
        "じしょ",
        "とけい",
        "ちず",
        "さいふ"
      ],
      correct: 1
    },
    {
      question: "わたしは　どうぶつが　すきです。",
      answers: [
        "わたしは　くるま　や　ひこうきが　すきです。",
        "わたしは　いぬ　や　ねこが　すきです。",
        "わたしは　こうちゃ　や　コーヒーが　すきです。",
        "わたしは　ケーキ　や　チョコレートが　すきです。"
      ],
      correct: 1
    },
    {
      question: "もりさんは「そぼは　いま、いえに　いません」と　いいました。",
      answers: [
        "もりさんの　おかあさんは　いま、いえに　いません。",
        "もりさんの　おとうさんは　いま、いえに　いません。",
        "もりさんの　おばあさんは　いま、いえに　いません。",
        "もりさんの　おじいさんは　いま、いえに　いません。"
      ],
      correct: 2
    },
    {
    question: "この　ジュースは　まずいです。",
    answers: [
      "この　ジュースは　つめたくないです。",
      "この　ジュースは　おいしくないです。",
      "この　ジュースは　からくないです。",
      "この　ジュースは　すっぱくないです。"
    ],
    correct: 1
    }
  ]
},

{
  id: 8,
  questions: [
    {
      question: "わたしの　うちは　えきに　ちかいですから、（　　　）です。",
      answers: [
        "じょうぶ",
        "へた",
        "いっぱい",
        "べんり"
      ],
      correct: 3
    },
    {
      question: "なつやすみは　まいにち（　　　）で　およぎました。",
      answers: [
        "プール",
        "レストラン",
        "ビル",
        "エレベーター"
      ],
      correct: 0
    },
    {
      question: "しらない　ことばが　ありましたから、せんせいに（　　　）しました。",
      answers: [
        "しつもん",
        "じゅぎょう",
        "べんきょう",
        "れんしゅう"
      ],
      correct: 0
    },
    {
      question: "この　へやは　あついですから、（　　　）を　あけましょう。",
      answers: [
        "おふろ",
        "まど",
        "エアコン",
        "テーブル"
      ],
      correct: 1
    },
    {
      question: "きのうは　がっこうで　たくさん　かんじを（　　　）。",
      answers: [
        "おぼえました",
        "こまりました",
        "もちました",
        "うりました"
      ],
      correct: 0
    },
    {
      question: "この　コーヒーは、さとうを　たくさん　いれましたから、（　　　）です。",
      answers: [
        "からい",
        "あまい",
        "まるい",
        "わかい"
      ],
      correct: 1
    },
    {
      question: "つよい　かぜが（　　　）います。",
      answers: [
        "いそいで",
        "はしって",
        "とんで",
        "ふいて"
      ],
      correct: 3
    },
    {
      question: "わたしは　まいあさ　さんぽして　います。",
      answers: [
        "わたしは　まいあさ　あるいて　います。",
        "わたしは　まいあさ　およいで　います。",
        "わたしは　まいあさ　はしって　います。",
        "わたしは　まいあさ　はたらいて　います。"
      ],
      correct: 0
    },
    {
      question: "あそこは　としょかんです。",
      answers: [
        "あそこは　ごはん　や　おかしを　つくる　ところです。",
        "あそこは　ほん　や　ざっしを　かりる　ところです。",
        "あそこは　かみ　や　からだを　あらう　ところです。",
        "あそこは　はがき　や　きってを　かう　ところです。"
      ],
      correct: 1
    },
    {
      question: "まいばん　テレビで　ニュースを　みます。",
      answers: [
        "まいにち　ゆうがた　テレビで　ニュースを　みます。",
        "まいにち　あさ　テレビで　ニュースを　みます。",
        "まいにち　ひる　テレビで　ニュースを　みます。",
        "まいにち　よる　テレビで　ニュースを　みます。"
      ],
      correct: 3
    }
  ]
},

{
  id: 9,
  questions: [
    {
      question: "へやが（　　　）ですから、ストーブを　つけましょう。",
      answers: [
        "つめたい",
        "ぬるい",
        "あつい",
        "さむい"
      ],
      correct: 3
    },
    {
      question: "つぎの（　　　）で　でんしゃを　おります。",
      answers: [
        "かいだん",
        "しんごう",
        "かど",
        "えき"
      ],
      correct: 3
    },
    {
      question: "なつやすみは　かぞくと　やまに（　　　）。",
      answers: [
        "のぼります",
        "あるきます",
        "あがります",
        "のります"
      ],
      correct: 0
    },
    {
      question: "きのうは（　　　）が　たくさん　ふりました。",
      answers: [
        "そら",
        "くもり",
        "みず",
        "ゆき"
      ],
      correct: 3
    },
    {
      question: "えんぴつを　4（　　　）かいました。",
      answers: [
        "ほん",
        "まい",
        "さつ",
        "だい"
      ],
      correct: 0
    },
    {
      question: "さとうさんは　めがねを（　　　）います。",
      answers: [
        "かけて",
        "はいて",
        "きて",
        "かぶって"
      ],
      correct: 0
    },
    {
      question: "かぜが（　　　）ですから、まどを　しめましょう。",
      answers: [
        "たかい",
        "つよい",
        "ながい",
        "ひろい"
      ],
      correct: 1
    },
    {
      question: "おとうとは　あの　レストランで　はたらいて　います。",
      answers: [
        "おとうとは　あの　レストランで　やすんで　います。",
        "おとうとは　あの　レストランで　しょくじを　して います。",
        "おとうとは　あの　レストランで　しごとを　して います。",
        "おとうとは　あの　レストランで　まって　います。"
      ],
      correct: 2
    },
    {
      question: "あの　みせは　しずか　じゃ　ありませんでした。",
      answers: [
        "あの　みせは　せまかったです。",
        "あの　みせは　くらかったです。",
        "あの　みせは　きたなかったです。",
        "あの　みせは　うるさかったです。"
      ],
      correct: 3
    },
    {
      question: "じゅぎょうで　むずかしい　かんじを　ならいました。",
      answers: [
        "じゅぎょうで　むずかしい　かんじを　みせました。",
        "じゅぎょうで　むずかしい　かんじを　おしえました。",
        "じゅぎょうで　むずかしい　かんじを　まちがえました。",
        "じゅぎょうで　むずかしい　かんじを　べんきょうしました。"
      ],
      correct: 3
    }
  ]
},

{
  id: 10,

  questions: [
    {
      question: "つぎのかどを　ひだりに（　　　）。",
      answers: [
        "まがります",
        "わたります",
        "のぼります",
        "とまります"
      ],
      correct: 0
    },
    {
      question: "きょうは　げつようびですから、デパートは　ひとが　すくなくて、（　　　）です。",
      answers: [
        "ゆうめい",
        "げんき",
        "にぎやか",
        "しずか"
      ],
      correct: 3
    },
    {
      question: "おばあさんは　しんぶんを　よむとき、いつも（　　　）を　かけます。",
      answers: [
        "でんわ",
        "せんたく",
        "めがね",
        "じしょ"
      ],
      correct: 2
    },
    {
      question: "まいあさ　なんじに　うちを（　　　）か。",
      answers: [
        "できます",
        "だします",
        "でます",
        "あるきます"
      ],
      correct: 2
    },
    {
      question: "わたしは　うたが（　　　）じゃ　ありませんから、うたいたくないです。",
      answers: [
        "にぎやか",
        "たいせつ",
        "じょうず",
        "べんり"
      ],
      correct: 2
    },
    {
      question: "いもうとは　いま（　　　）を　みがいて　います。",
      answers: [
        "はな",
        "かお",
        "くち",
        "は"
      ],
      correct: 3
    },
    {
      question: "みちが　わかりませんから、（　　　）を　かいて　ください。",
      answers: [
        "てがみ",
        "ちず",
        "レポート",
        "コピー"
      ],
      correct: 1
    },
    {
      question: "りょうしんは　でかけて　います。",
      answers: [
        "あにも　おとうとも　でかけて　います。",
        "おばも　おじも　でかけて　います。",
        "ちちも　ははも　でかけて　います。",
        "あねも　いもうとも　でかけて　います。"
      ],
      correct: 2
    },
    {
      question: "この　でんしじしょを　かして　ください。",
      answers: [
        "この　でんしじしょを　かえしたいです。",
        "この　でんしじしょを　かりたいです。",
        "この　でんしじしょを　かいたいです。",
        "この　でんしじしょを　だしたいです。"
      ],
      correct: 1
    },
    {
      question: "この　もんだいは　むずかしく　ありません。",
      answers: [
        "この　もんだいは　みじかいです。",
        "この　もんだいは　わかりません。",
        "この　もんだいは　できません。",
        "この　もんだいは　やさしいです。"
      ],
      correct: 3
    }
  ]
}
  ]
}
